// key: TKCのコード, value: Smileのコード
const smileAccountTables = {
  1111: 101, //小口現金
  1113: 103, //普通預金
  1122: 109, //売掛金
  1131: 116, //商品
  1132: 111, //製品
  1138: 112, //製品評価損引当額
  1134: 113, //原材料
  1137: 114, //原材料保守部品償却累計額
  1136: 115, //貯蔵品
  1152: 122, //前払費用
  1151: 118, //前払金
  1154: 120, //未収入金
  1155: 119, //立替金
  1156: 121, //仮払金
  1164: 123, //仮払消費税等
  1161: 124, //未収消費税
  1157: 125, //仮払税金
  1162: 126, //未収還付法人税等
  1218: 201, //建物付属設備
  1226: 209, //建物附属設備減価償却累計
  1213: 203, //機械及び装置
  1216: 205, //工具、器具及び備品
  1225: 211, //器具備品減価償却累計額
  1222: 208, //建設仮勘定(有形)
  1234: 214, //仮払金（仮）
  1235: 212, //商標権
  1237: 215, //ソフトウェア
  1238: 216, //ソフトウェア仮勘定
  1255: 220, //敷金・保証金
  9991: 217, //資金諸口
  9992: 218, //資金外諸口
  2112: 403, //買掛金
  2114: 405, //未払金
  2115: 406, //未払費用
  2125: 415, //未払法人税等
  2116: 410, //前受金
  2117: 409, //預り金
  2121: 411, //社会保険預り金
  2118: 420, //前受収益
  2119: 408, //仮受金
  2164: 412, //仮受消費税等
  2123: 417, //匿名組合出資預り金
  2126: 413, //賞与引当金
  2127: 416, //製品保証引当金
  2265: 419, //繰延税金負債
  2311: 422, //製品保証引当金
  2312: 427, //資産除去債務
  3111: 501, //資本金
  3211: 502, //資本準備金
  3331: 542, //繰越利益余剰金
  3611: 546, //新株予約権
  4111: 601, //商品売上高
  4112: 602, //商品転用売上
  4113: 603, //部品売上
  4114: 604, //レンタル売上
  4116: 605, //その他売上
  4117: 624, //保守売上
  4115: 606, //売上値引戻り高
  5111: 607, //期首商品及び製品棚卸高
  5211: 622, //商品仕入高
  5216: 608, //減価償却費
  5217: 609, //製品評価損
  5218: 610, //原材料評価損
  5273: 611, //他勘定振替高
  5311: 612, //期末商品及び製品棚卸高
  6211: 701, //役員報酬
  6111: 702, //給料手当
  6213: 709, //従業員賞与
  6315: 706, //賞与引当金繰入
  6311: 710, //雑給
  6321: 708, //通勤手当
  6322: 707, //退職給付費用
  6312: 704, //法定福利費
  6226: 705, //福利厚生費
  6212: 717, //人件費諸費
  6320: 703, //株式報酬費用
  6115: 720, //発送配達費
  6113: 716, //広告宣伝費
  6318: 726, //保管料
  6317: 734, //販売手数料
  6319: 714, //販売促進費
  6223: 718, //接待交際費
  6114: 724, //人材採用費
  6112: 713, //旅費交通費
  6218: 715, //通信費
  6225: 729, //消耗器具備品
  6217: 712, //事務用品費
  6224: 731, //保険料
  6216: 737, //修繕費
  6232: 735, //事務所管理諸費
  6233: 732, //新聞図書費
  6215: 725, //地代家賃
  6116: 733, //支払手数料
  6313: 721, //諸会費
  6228: 722, //会議費
  6221: 730, //租税公課
  6118: 736, //展示会費用
  6214: 728, //減価償却費
  6117: 739, //業務委託料
  6229: 740, //研究開発費
  6234: 741, //支払リース料
  6227: 742, //支払報酬
  6119: 743, //製品保証引当金繰入
  6219: 744, //水道光熱費
  6316: 745, //利息費用
  6231: 738, //雑費
  7111: 801, //受取利息
  7112: 804, //製品保証引当金戻入
  7113: 805, //補助金収入
  7118: 806, //雑収入
  7513: 803, //匿名組合損益分配額
  7516: 810, //為替差損
  7519: 812, //雑損失
  8114: 903, //前期損益修正益
  8212: 912, //固定資産除却損
  8215: 909, //減損損失
  8214: 908, //前期損益修正損
  8311: 920, //法人税、住民税及び事業税
  8312: 921, //法人税等調整額
  9211: 507, //繰越利益剰余金期首残高
  5411: 620, //期首材料たな卸高
  5412: 623, //材料仕入高
  5413: 627, //期末材料たな卸高
  5441: 638, //外注加工費
  5454: 650, //運賃
  5455: 658, //減価償却費
  5456: 663, //修繕費
  5473: 669, //他勘定振替高
}

const errroCodes = []

const getSmileAccountCode = (fromCode) => {
  if (fromCode in smileAccountTables) {
    return smileAccountTables[fromCode]
  }

  if (errroCodes.includes(fromCode)) {
    return
  }
  errroCodes.push(fromCode)
  console.log(errroCodes.join())
}


module.exports = {
  getSmileAccountCode
}
