// key: TKCのコード, value: Smileのコード
const codeTable =
  [
    {from: ["1113", "1"],  to: ["103", "1000"]},   //TKC_勘定科目名:  三菱八王子415641、  smile勘定科目名:  普通預金
    {from: ["1113", "2"],  to: ["103", "1001"]},   //TKC_勘定科目名:  三菱八王子495658助成金、  smile勘定科目名:  普通預金
    {from: ["1113", "3"],  to: ["103", "1002"]},   //TKC_勘定科目名:  三菱八王子536849小口、  smile勘定科目名:  普通預金
    {from: ["1113", "4"],  to: ["103", "1003"]},   //TKC_勘定科目名:  西武信金飯田橋2566、  smile勘定科目名:  普通預金
    {from: ["1113", "5"],  to: ["103", "1004"]},   //TKC_勘定科目名:  多摩信金八王子四谷520203、  smile勘定科目名:  普通預金
    {from: ["1113", "6"],  to: ["103", "1005"]},   //TKC_勘定科目名:  福島銀行川俣支店1049505、  smile勘定科目名:  普通預金
    {from: ["1113", "7"],  to: ["103", "1006"]},   //TKC_勘定科目名:  大東銀行川俣支店、  smile勘定科目名:  普通預金
    {from: ["1113", "8"],  to: ["103", "1007"]},   //TKC_勘定科目名:  あぶくま信金小高3009、  smile勘定科目名:  普通預金
    {from: ["1113", "9"],  to: ["103", "1008"]},   //TKC_勘定科目名:  東邦銀行川俣支店、  smile勘定科目名:  普通預金
    {from: ["1113", "10"],  to: ["103", "1009"]},   //TKC_勘定科目名:  みずほ銀行銀座通2463946、  smile勘定科目名:  普通預金
    {from: ["1113", "11"],  to: ["103", "1010"]},   //TKC_勘定科目名:  ソニー銀行、  smile勘定科目名:  普通預金
    {from: ["1113", "12"],  to: ["103", "1011"]},   //TKC_勘定科目名:  三菱UFJ信託銀行本店4734893、  smile勘定科目名:  普通預金
    {from: ["1113", "13"],  to: ["103", "1012"]},   //TKC_勘定科目名:  三井住友銀行飯田橋支店7247621、  smile勘定科目名:  普通預金
    {from: ["1113", "14"],  to: ["103", "1013"]},   //TKC_勘定科目名:  三井住友銀行飯田橋支店7251707、  smile勘定科目名:  普通預金
    {from: ["1113", "15"],  to: ["103", "1014"]},   //TKC_勘定科目名:  三井住友信託本店営業部0646234、  smile勘定科目名:  普通預金
    {from: ["1113", "Z"],  to: ["103", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  普通預金
    {from: ["1152", "1"],  to: ["122", "1000"]},   //TKC_勘定科目名:  東京理科大学　小林研究室、  smile勘定科目名:  前払費用
    {from: ["1152", "2"],  to: ["122", "1001"]},   //TKC_勘定科目名:  勘定奉行保守OMSS、  smile勘定科目名:  前払費用
    {from: ["1152", "3"],  to: ["122", "1002"]},   //TKC_勘定科目名:  南相馬営業所　菊池製作所、  smile勘定科目名:  前払費用
    {from: ["1152", "4"],  to: ["122", "1003"]},   //TKC_勘定科目名:  保守メンテ業務委託　JSC、  smile勘定科目名:  前払費用
    {from: ["1152", "5"],  to: ["122", "1004"]},   //TKC_勘定科目名:  従業員通勤手当、  smile勘定科目名:  前払費用
    {from: ["1152", "6"],  to: ["122", "1005"]},   //TKC_勘定科目名:  リコージャパン㈱　Gメールサービ、  smile勘定科目名:  前払費用
    {from: ["1152", "7"],  to: ["122", "1006"]},   //TKC_勘定科目名:  アドビシステムズ　年間ライセンス、  smile勘定科目名:  前払費用
    {from: ["1152", "8"],  to: ["122", "1007"]},   //TKC_勘定科目名:  償却資産税　南相馬市、  smile勘定科目名:  前払費用
    {from: ["1152", "9"],  to: ["122", "1008"]},   //TKC_勘定科目名:  ソリッドワークス保守、  smile勘定科目名:  前払費用
    {from: ["1152", "10"],  to: ["122", "1009"]},   //TKC_勘定科目名:  ソリッドワークス２保守、  smile勘定科目名:  前払費用
    {from: ["1152", "11"],  to: ["122", "1010"]},   //TKC_勘定科目名:  PL保険　MST保険ｻｰﾋﾞｽ㈱、  smile勘定科目名:  前払費用
    {from: ["1152", "13"],  to: ["122", "1011"]},   //TKC_勘定科目名:  海外PL保険、  smile勘定科目名:  前払費用
    {from: ["1152", "14"],  to: ["122", "1012"]},   //TKC_勘定科目名:  労働保険料　概算支払い、  smile勘定科目名:  前払費用
    {from: ["1152", "15"],  to: ["122", "1013"]},   //TKC_勘定科目名:  償却資産税　新宿区、  smile勘定科目名:  前払費用
    {from: ["1152", "16"],  to: ["122", "1014"]},   //TKC_勘定科目名:  ﾛﾎﾞｯﾄ革命ｲﾆｼｱﾃｨﾌﾞ　年会費、  smile勘定科目名:  前払費用
    {from: ["1152", "17"],  to: ["122", "1015"]},   //TKC_勘定科目名:  建築研究開発コンソーシアム　年会、  smile勘定科目名:  前払費用
    {from: ["1152", "18"],  to: ["122", "1016"]},   //TKC_勘定科目名:  WEBARENA　NTTPCｺﾐｭﾆｹ-、  smile勘定科目名:  前払費用
    {from: ["1152", "19"],  to: ["122", "1017"]},   //TKC_勘定科目名:  理科大　意匠出願指導、  smile勘定科目名:  前払費用
    {from: ["1152", "20"],  to: ["122", "1018"]},   //TKC_勘定科目名:  ﾋﾞｼﾞﾈｽ実践研究所(RobiZy)、  smile勘定科目名:  前払費用
    {from: ["1152", "21"],  to: ["122", "1019"]},   //TKC_勘定科目名:  リードエグジビションジャパン、  smile勘定科目名:  前払費用
    {from: ["1152", "22"],  to: ["122", "1020"]},   //TKC_勘定科目名:  第一生命保険　PL保険、  smile勘定科目名:  前払費用
    {from: ["1152", "25"],  to: ["122", "1021"]},   //TKC_勘定科目名:  BearTail、  smile勘定科目名:  前払費用
    {from: ["1152", "26"],  to: ["122", "1022"]},   //TKC_勘定科目名:  かながわ福祉ｻｰﾋﾞﾙ振興会、  smile勘定科目名:  前払費用
    {from: ["1152", "27"],  to: ["122", "1023"]},   //TKC_勘定科目名:  ﾃｸﾉｴｲﾄﾞ協会、  smile勘定科目名:  前払費用
    {from: ["1152", "28"],  to: ["122", "1024"]},   //TKC_勘定科目名:  Slack、  smile勘定科目名:  前払費用
    {from: ["1152", "29"],  to: ["122", "1025"]},   //TKC_勘定科目名:  北海道ﾍﾙｽｹｱﾛﾎﾞｯﾄ協会、  smile勘定科目名:  前払費用
    {from: ["1152", "30"],  to: ["122", "1026"]},   //TKC_勘定科目名:  KINTONE 年間保守、  smile勘定科目名:  前払費用
    {from: ["1152", "31"],  to: ["122", "1027"]},   //TKC_勘定科目名:  福島事務所、  smile勘定科目名:  前払費用
    {from: ["1152", "32"],  to: ["122", "1028"]},   //TKC_勘定科目名:  ﾀﾚﾝﾄ契約料、  smile勘定科目名:  前払費用
    {from: ["1152", "33"],  to: ["122", "1029"]},   //TKC_勘定科目名:  CM製作費、  smile勘定科目名:  前払費用
    {from: ["1152", "34"],  to: ["122", "1030"]},   //TKC_勘定科目名:  ﾃﾞｲﾘｽﾎﾟｰﾂ　連結ｽﾃｯｶｰ、  smile勘定科目名:  前払費用
    {from: ["1152", "35"],  to: ["122", "1031"]},   //TKC_勘定科目名:  動画関係、  smile勘定科目名:  前払費用
    {from: ["1152", "36"],  to: ["122", "1032"]},   //TKC_勘定科目名:  帝国データバンク、  smile勘定科目名:  前払費用
    {from: ["1152", "Z"],  to: ["122", "9999"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  前払費用
    {from: ["2115", "36"],  to: ["405", "1000"]},   //TKC_勘定科目名:  社会保険・労働保険料、  smile勘定科目名:  未払費用
    {from: ["2115", "75"],  to: ["405", "1001"]},   //TKC_勘定科目名:  残業代、  smile勘定科目名:  未払費用
    {from: ["2115", "90"],  to: ["405", "1002"]},   //TKC_勘定科目名:  会社負担　健康保険料、  smile勘定科目名:  未払費用
    {from: ["2115", "91"],  to: ["405", "1003"]},   //TKC_勘定科目名:  会社負担　介護保険料、  smile勘定科目名:  未払費用
    {from: ["2115", "92"],  to: ["405", "1004"]},   //TKC_勘定科目名:  会社負担　厚生年金、  smile勘定科目名:  未払費用
    {from: ["2115", "93"],  to: ["405", "1005"]},   //TKC_勘定科目名:  会社負担　社会保険料、  smile勘定科目名:  未払費用
    {from: ["2115", "94"],  to: ["405", "1006"]},   //TKC_勘定科目名:  確定拠出年金　従業員負担分、  smile勘定科目名:  未払費用
    {from: ["2115", "95"],  to: ["405", "1007"]},   //TKC_勘定科目名:  確定拠出年金　会社負担分、  smile勘定科目名:  未払費用
    {from: ["2115", "97"],  to: ["405", "1008"]},   //TKC_勘定科目名:  ﾊﾟｰﾄ、  smile勘定科目名:  未払費用
    {from: ["2115", "101"],  to: ["405", "1009"]},   //TKC_勘定科目名:  償却資産税　新宿区、  smile勘定科目名:  未払費用
    {from: ["2115", "102"],  to: ["405", "1010"]},   //TKC_勘定科目名:  償却資産税　南相馬市、  smile勘定科目名:  未払費用
    {from: ["2115", "999"],  to: ["405", "1011"]},   //TKC_勘定科目名:  給与、  smile勘定科目名:  未払費用
    {from: ["2115", "Z"],  to: ["405", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  未払費用
    {from: ["2117", "1"],  to: ["408", "1000"]},   //TKC_勘定科目名:  給与源泉預り金、  smile勘定科目名:  預り金
    {from: ["2117", "2"],  to: ["408", "1001"]},   //TKC_勘定科目名:  報酬源泉預り金、  smile勘定科目名:  預り金
    {from: ["2117", "3"],  to: ["408", "1002"]},   //TKC_勘定科目名:  住民税、  smile勘定科目名:  預り金
    {from: ["2117", "4"],  to: ["408", "1003"]},   //TKC_勘定科目名:  持株会拠出金、  smile勘定科目名:  預り金
    {from: ["2117", "Z"],  to: ["408", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  預り金
    {from: ["2121", "1"],  to: ["410", "1000"]},   //TKC_勘定科目名:  健康保険、  smile勘定科目名:  社会保険預り金
    {from: ["2121", "2"],  to: ["410", "1001"]},   //TKC_勘定科目名:  介護保険、  smile勘定科目名:  社会保険預り金
    {from: ["2121", "3"],  to: ["410", "1002"]},   //TKC_勘定科目名:  厚生年金、  smile勘定科目名:  社会保険預り金
    {from: ["2121", "4"],  to: ["410", "1003"]},   //TKC_勘定科目名:  雇用保険、  smile勘定科目名:  社会保険預り金
    {from: ["2121", "Z"],  to: ["410", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  社会保険預り金
    {from: ["3611", "A"],  to: ["546", "1000"]},   //TKC_勘定科目名:  第5回、  smile勘定科目名:  新株予約権
    {from: ["3611", "Z"],  to: ["546", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  新株予約権
    {from: ["5216", "A"],  to: ["636", "1000"]},   //TKC_勘定科目名:  器具備品、  smile勘定科目名:  減価償却費
    {from: ["5216", "Z"],  to: ["636", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  減価償却費
    {from: ["6111", "A"],  to: ["742", "1000"]},   //TKC_勘定科目名:  給与支給、  smile勘定科目名:  給料手当
    {from: ["6111", "B"],  to: ["742", "1001"]},   //TKC_勘定科目名:  業務委託収入、  smile勘定科目名:  給料手当
    {from: ["6111", "Z"],  to: ["742", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  給料手当
    {from: ["6320", "A"],  to: ["749", "1000"]},   //TKC_勘定科目名:  第5回、  smile勘定科目名:  株式報酬費用
    {from: ["6320", "Z"],  to: ["749", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  株式報酬費用
    {from: ["6115", "0"],  to: ["784", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  発送配達費
    {from: ["6115", "1"],  to: ["784", "1001"]},   //TKC_勘定科目名:  マッスルスーツ、  smile勘定科目名:  発送配達費
    {from: ["6115", "2"],  to: ["784", "1002"]},   //TKC_勘定科目名:  イノフィス発送分、  smile勘定科目名:  発送配達費
    {from: ["6115", "3"],  to: ["784", "1003"]},   //TKC_勘定科目名:  菊池製作所発送分、  smile勘定科目名:  発送配達費
    {from: ["6115", "4"],  to: ["784", "1004"]},   //TKC_勘定科目名:  アマゾン、  smile勘定科目名:  発送配達費
    {from: ["6115", "10"],  to: ["784", "1005"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  発送配達費
    {from: ["6115", "A"],  to: ["784", "1006"]},   //TKC_勘定科目名:  富士ロジ、  smile勘定科目名:  発送配達費
    {from: ["6115", "B"],  to: ["784", "1007"]},   //TKC_勘定科目名:  リコーエレメックス、  smile勘定科目名:  発送配達費
    {from: ["6115", "Z"],  to: ["784", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  発送配達費
    {from: ["6113", "A"],  to: ["701", "1000"]},   //TKC_勘定科目名:  広告その他、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "B"],  to: ["701", "1001"]},   //TKC_勘定科目名:  広告新聞、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "C"],  to: ["701", "1002"]},   //TKC_勘定科目名:  広告名刺印刷、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "D"],  to: ["701", "1003"]},   //TKC_勘定科目名:  制作ターポリン、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "E"],  to: ["701", "1004"]},   //TKC_勘定科目名:  制作タレント、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "F"],  to: ["701", "1005"]},   //TKC_勘定科目名:  制作ブランドサイト、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "G"],  to: ["701", "1006"]},   //TKC_勘定科目名:  制作製品説明動画、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "H"],  to: ["701", "1007"]},   //TKC_勘定科目名:  制作製品同梱物、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "I"],  to: ["701", "1008"]},   //TKC_勘定科目名:  制作その他、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "J"],  to: ["701", "1009"]},   //TKC_勘定科目名:  制作ポスター、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "K"],  to: ["701", "1010"]},   //TKC_勘定科目名:  Amazon費用、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "L"],  to: ["701", "1011"]},   //TKC_勘定科目名:  制作ｸﾞﾗﾌｨｯｸｽ、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "M"],  to: ["701", "1012"]},   //TKC_勘定科目名:  広告TV、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "N"],  to: ["701", "1013"]},   //TKC_勘定科目名:  制作CM、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "O"],  to: ["701", "1014"]},   //TKC_勘定科目名:  広告Web、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "P"],  to: ["701", "1015"]},   //TKC_勘定科目名:  制作会社案内、  smile勘定科目名:  広告宣伝費
    {from: ["6113", "Z"],  to: ["701", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  広告宣伝費
    {from: ["6318", "A"],  to: ["767", "1000"]},   //TKC_勘定科目名:  アマゾン、  smile勘定科目名:  保管料
    {from: ["6318", "B"],  to: ["767", "1001"]},   //TKC_勘定科目名:  富士ロジ、  smile勘定科目名:  保管料
    {from: ["6318", "C"],  to: ["767", "1002"]},   //TKC_勘定科目名:  リコーエレメックス、  smile勘定科目名:  保管料
    {from: ["6318", "Z"],  to: ["767", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  保管料
    {from: ["6317", "A"],  to: ["703", "1000"]},   //TKC_勘定科目名:  アマゾン、  smile勘定科目名:  販売手数料
    {from: ["6317", "Z"],  to: ["703", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  販売手数料
    {from: ["6319", "A"],  to: ["702", "1000"]},   //TKC_勘定科目名:  販促ポスター印刷、  smile勘定科目名:  販売促進費
    {from: ["6319", "B"],  to: ["702", "1001"]},   //TKC_勘定科目名:  販促機体カバー、  smile勘定科目名:  販売促進費
    {from: ["6319", "C"],  to: ["702", "1002"]},   //TKC_勘定科目名:  販促売場制作費用、  smile勘定科目名:  販売促進費
    {from: ["6319", "D"],  to: ["702", "1003"]},   //TKC_勘定科目名:  報奨金、  smile勘定科目名:  販売促進費
    {from: ["6319", "E"],  to: ["702", "1004"]},   //TKC_勘定科目名:  Amazonｸﾘｯｸ課金料、  smile勘定科目名:  販売促進費
    {from: ["6319", "F"],  to: ["702", "1005"]},   //TKC_勘定科目名:  店頭以外デモ費用、  smile勘定科目名:  販売促進費
    {from: ["6319", "G"],  to: ["702", "1006"]},   //TKC_勘定科目名:  Amazon PointsGranted、  smile勘定科目名:  販売促進費
    {from: ["6319", "Z"],  to: ["702", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  販売促進費
    {from: ["6223", "0"],  to: ["771", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  接待交際費
    {from: ["6223", "1"],  to: ["771", "1001"]},   //TKC_勘定科目名:  飲食代、  smile勘定科目名:  接待交際費
    {from: ["6223", "3"],  to: ["771", "1002"]},   //TKC_勘定科目名:  贈答、  smile勘定科目名:  接待交際費
    {from: ["6223", "Z"],  to: ["771", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  接待交際費
    {from: ["6112", "0"],  to: ["761", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  旅費交通費
    {from: ["6112", "2"],  to: ["761", "1001"]},   //TKC_勘定科目名:  出張旅費交通費、  smile勘定科目名:  旅費交通費
    {from: ["6112", "4"],  to: ["761", "1002"]},   //TKC_勘定科目名:  宿泊費、  smile勘定科目名:  旅費交通費
    {from: ["6112", "5"],  to: ["761", "1003"]},   //TKC_勘定科目名:  ガソリン代、  smile勘定科目名:  旅費交通費
    {from: ["6112", "6"],  to: ["761", "1004"]},   //TKC_勘定科目名:  駐車料金、  smile勘定科目名:  旅費交通費
    {from: ["6112", "7"],  to: ["761", "1005"]},   //TKC_勘定科目名:  タクシー代、  smile勘定科目名:  旅費交通費
    {from: ["6112", "9"],  to: ["761", "1006"]},   //TKC_勘定科目名:  営業交通費、  smile勘定科目名:  旅費交通費
    {from: ["6112", "10"],  to: ["761", "1007"]},   //TKC_勘定科目名:  出張旅費手当、  smile勘定科目名:  旅費交通費
    {from: ["6112", "12"],  to: ["761", "1008"]},   //TKC_勘定科目名:  レンタカー代、  smile勘定科目名:  旅費交通費
    {from: ["6112", "100"],  to: ["761", "1009"]},   //TKC_勘定科目名:  福島補助金対象、  smile勘定科目名:  旅費交通費
    {from: ["6112", "Z"],  to: ["761", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  旅費交通費
    {from: ["6218", "1"],  to: ["762", "1000"]},   //TKC_勘定科目名:  切手等郵送費、  smile勘定科目名:  通信費
    {from: ["6218", "2"],  to: ["762", "1001"]},   //TKC_勘定科目名:  電話、  smile勘定科目名:  通信費
    {from: ["6218", "3"],  to: ["762", "1002"]},   //TKC_勘定科目名:  NTT WebARENA、  smile勘定科目名:  通信費
    {from: ["6218", "Z"],  to: ["762", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  通信費
    {from: ["6225", "0"],  to: ["773", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  消耗器具備品
    {from: ["6225", "1"],  to: ["773", "1001"]},   //TKC_勘定科目名:  一括償却資産、  smile勘定科目名:  消耗器具備品
    {from: ["6225", "10"],  to: ["773", "1002"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  消耗器具備品
    {from: ["6225", "100"],  to: ["773", "1003"]},   //TKC_勘定科目名:  福島補助金対象、  smile勘定科目名:  消耗器具備品
    {from: ["6225", "Z"],  to: ["773", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  消耗器具備品
    {from: ["6216", "0"],  to: ["776", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  修繕費
    {from: ["6216", "1"],  to: ["776", "1001"]},   //TKC_勘定科目名:  ｼﾞｪｲｴｽｷｭ-ﾌﾞSA保守 材料費、  smile勘定科目名:  修繕費
    {from: ["6216", "2"],  to: ["776", "1002"]},   //TKC_勘定科目名:  MS イノフィス保有機、  smile勘定科目名:  修繕費
    {from: ["6216", "4"],  to: ["776", "1003"]},   //TKC_勘定科目名:  菊池製作所　貸出機修繕費用、  smile勘定科目名:  修繕費
    {from: ["6216", "Z"],  to: ["776", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  修繕費
    {from: ["6215", "1"],  to: ["766", "1000"]},   //TKC_勘定科目名:  森戸記念館3階、  smile勘定科目名:  地代家賃
    {from: ["6215", "2"],  to: ["766", "1001"]},   //TKC_勘定科目名:  神楽坂駐車場、  smile勘定科目名:  地代家賃
    {from: ["6215", "3"],  to: ["766", "1002"]},   //TKC_勘定科目名:  菊池製作所　南相馬支店、  smile勘定科目名:  地代家賃
    {from: ["6215", "4"],  to: ["766", "1003"]},   //TKC_勘定科目名:  福島事務所、  smile勘定科目名:  地代家賃
    {from: ["6215", "5"],  to: ["766", "1004"]},   //TKC_勘定科目名:  福島事務所(社宅)、  smile勘定科目名:  地代家賃
    {from: ["6215", "Z"],  to: ["766", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  地代家賃
    {from: ["6116", "0"],  to: ["770", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  支払手数料
    {from: ["6116", "1"],  to: ["770", "1001"]},   //TKC_勘定科目名:  菊池製作所、  smile勘定科目名:  支払手数料
    {from: ["6116", "2"],  to: ["770", "1002"]},   //TKC_勘定科目名:  グッドデザイン賞、  smile勘定科目名:  支払手数料
    {from: ["6116", "A"],  to: ["770", "1003"]},   //TKC_勘定科目名:  FB利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "B"],  to: ["770", "1004"]},   //TKC_勘定科目名:  リスクモンスター利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "C"],  to: ["770", "1005"]},   //TKC_勘定科目名:  海外送金手数料、  smile勘定科目名:  支払手数料
    {from: ["6116", "D"],  to: ["770", "1006"]},   //TKC_勘定科目名:  銀行残高証明書、  smile勘定科目名:  支払手数料
    {from: ["6116", "E"],  to: ["770", "1007"]},   //TKC_勘定科目名:  振込手数料、  smile勘定科目名:  支払手数料
    {from: ["6116", "F"],  to: ["770", "1008"]},   //TKC_勘定科目名:  日経テレコン利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "G"],  to: ["770", "1009"]},   //TKC_勘定科目名:  住民税納付利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "H"],  to: ["770", "1010"]},   //TKC_勘定科目名:  開示関連利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "I"],  to: ["770", "1011"]},   //TKC_勘定科目名:  クリッピング利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "J"],  to: ["770", "1012"]},   //TKC_勘定科目名:  上場関連利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "K"],  to: ["770", "1013"]},   //TKC_勘定科目名:  顧客管理費用、  smile勘定科目名:  支払手数料
    {from: ["6116", "L"],  to: ["770", "1014"]},   //TKC_勘定科目名:  販売管理システム利用料、  smile勘定科目名:  支払手数料
    {from: ["6116", "M"],  to: ["770", "1015"]},   //TKC_勘定科目名:  PC視聴ｻｰﾋﾞｽ、  smile勘定科目名:  支払手数料
    {from: ["6116", "Z"],  to: ["770", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  支払手数料
    {from: ["6221", "2"],  to: ["781", "1000"]},   //TKC_勘定科目名:  償却資産税、  smile勘定科目名:  租税公課
    {from: ["6221", "3"],  to: ["781", "1001"]},   //TKC_勘定科目名:  外形標準課税、  smile勘定科目名:  租税公課
    {from: ["6221", "4"],  to: ["781", "1002"]},   //TKC_勘定科目名:  印紙、  smile勘定科目名:  租税公課
    {from: ["6221", "5"],  to: ["781", "1003"]},   //TKC_勘定科目名:  行政手数料、  smile勘定科目名:  租税公課
    {from: ["6221", "Z"],  to: ["781", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  租税公課
    {from: ["6118", "1"],  to: ["704", "1000"]},   //TKC_勘定科目名:  福島補助金、  smile勘定科目名:  展示会費用
    {from: ["6118", "Z"],  to: ["704", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  展示会費用
    {from: ["6214", "A"],  to: ["782", "1000"]},   //TKC_勘定科目名:  建物付属設備、  smile勘定科目名:  減価償却費
    {from: ["6214", "B"],  to: ["782", "1001"]},   //TKC_勘定科目名:  資産除去債務、  smile勘定科目名:  減価償却費
    {from: ["6214", "C"],  to: ["782", "1002"]},   //TKC_勘定科目名:  器具備品、  smile勘定科目名:  減価償却費
    {from: ["6214", "D"],  to: ["782", "1003"]},   //TKC_勘定科目名:  ソフトウェア、  smile勘定科目名:  減価償却費
    {from: ["6214", "Z"],  to: ["782", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  減価償却費
    {from: ["6117", "0"],  to: ["765", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  業務委託料
    {from: ["6117", "2"],  to: ["765", "1001"]},   //TKC_勘定科目名:  あずさ監査法人、  smile勘定科目名:  業務委託料
    {from: ["6117", "3"],  to: ["765", "1002"]},   //TKC_勘定科目名:  勘定奉行保守OMSS、  smile勘定科目名:  業務委託料
    {from: ["6117", "5"],  to: ["765", "1003"]},   //TKC_勘定科目名:  ジェイエスキューブSA保守契約、  smile勘定科目名:  業務委託料
    {from: ["6117", "6"],  to: ["765", "1004"]},   //TKC_勘定科目名:  アドビシステムズ、  smile勘定科目名:  業務委託料
    {from: ["6117", "7"],  to: ["765", "1005"]},   //TKC_勘定科目名:  ソリッドワークス保守、  smile勘定科目名:  業務委託料
    {from: ["6117", "8"],  to: ["765", "1006"]},   //TKC_勘定科目名:  菊池製作所　貸出業務委託、  smile勘定科目名:  業務委託料
    {from: ["6117", "9"],  to: ["765", "1007"]},   //TKC_勘定科目名:  ﾘｺｰKINTONE 保守、  smile勘定科目名:  業務委託料
    {from: ["6117", "100"],  to: ["765", "1008"]},   //TKC_勘定科目名:  福島補助金対象、  smile勘定科目名:  業務委託料
    {from: ["6117", "101"],  to: ["765", "1009"]},   //TKC_勘定科目名:  エンビジョン㈱、  smile勘定科目名:  業務委託料
    {from: ["6117", "104"],  to: ["765", "1010"]},   //TKC_勘定科目名:  ㈱アクロスザシー、  smile勘定科目名:  業務委託料
    {from: ["6117", "105"],  to: ["765", "1011"]},   //TKC_勘定科目名:  理科大　意匠出願指導、  smile勘定科目名:  業務委託料
    {from: ["6117", "A"],  to: ["765", "1012"]},   //TKC_勘定科目名:  ヘルプデスク関連費用、  smile勘定科目名:  業務委託料
    {from: ["6117", "B"],  to: ["765", "1013"]},   //TKC_勘定科目名:  レンタル関連費用、  smile勘定科目名:  業務委託料
    {from: ["6117", "C"],  to: ["765", "1014"]},   //TKC_勘定科目名:  営業支援関連、  smile勘定科目名:  業務委託料
    {from: ["6117", "D"],  to: ["765", "1015"]},   //TKC_勘定科目名:  製品デザイン費用、  smile勘定科目名:  業務委託料
    {from: ["6117", "E"],  to: ["765", "1016"]},   //TKC_勘定科目名:  システム導入等、  smile勘定科目名:  業務委託料
    {from: ["6117", "Z"],  to: ["765", "9999"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  業務委託料
    {from: ["6229", "0"],  to: ["763", "1000"]},   //TKC_勘定科目名:  その他、  smile勘定科目名:  研究開発費
    {from: ["6229", "1"],  to: ["763", "1001"]},   //TKC_勘定科目名:  小林研究室、  smile勘定科目名:  研究開発費
    {from: ["6229", "2"],  to: ["763", "1002"]},   //TKC_勘定科目名:  菊池製作所、  smile勘定科目名:  研究開発費
    {from: ["6229", "3"],  to: ["763", "1003"]},   //TKC_勘定科目名:  減価償却費、  smile勘定科目名:  研究開発費
    {from: ["6229", "100"],  to: ["763", "1004"]},   //TKC_勘定科目名:  福島復興補助金、  smile勘定科目名:  研究開発費
    {from: ["6229", "101"],  to: ["763", "1005"]},   //TKC_勘定科目名:  福島補助金（菊池製作所）、  smile勘定科目名:  研究開発費
    {from: ["6229", "Z"],  to: ["763", "9999"]},   //TKC_勘定科目名:その他、  smile勘定科目名:  研究開発費
    {from: ["6234", "1"],  to: ["779", "1000"]},   //TKC_勘定科目名:  PCリース料、  smile勘定科目名:  支払リース料
    {from: ["6234", "2"],  to: ["779", "1001"]},   //TKC_勘定科目名:  コピー機リース料、  smile勘定科目名:  支払リース料
    {from: ["6234", "3"],  to: ["779", "1002"]},   //TKC_勘定科目名:  社有車　リース料、  smile勘定科目名:  支払リース料
    {from: ["6234", "Z"],  to: ["779", "9999"]},   //TKC_勘定科目名:その他、  smile勘定科目名:  支払リース料
    {from: ["6227", "1"],  to: ["764", "1000"]},   //TKC_勘定科目名:  東京理科大学、  smile勘定科目名:  支払報酬
    {from: ["6227", "14"],  to: ["764", "1001"]},   //TKC_勘定科目名:  原田　寿政、  smile勘定科目名:  支払報酬
    {from: ["6227", "15"],  to: ["764", "1002"]},   //TKC_勘定科目名:  宇野・御苑会計社、  smile勘定科目名:  支払報酬
    {from: ["6227", "21"],  to: ["764", "1003"]},   //TKC_勘定科目名:  シティユーワ法律事務所、  smile勘定科目名:  支払報酬
    {from: ["6227", "22"],  to: ["764", "1004"]},   //TKC_勘定科目名:  エンビジョン㈱、  smile勘定科目名:  支払報酬
    {from: ["6227", "29"],  to: ["764", "1005"]},   //TKC_勘定科目名:  太陽国際特許事務所、  smile勘定科目名:  支払報酬
    {from: ["6227", "34"],  to: ["764", "1006"]},   //TKC_勘定科目名:  長澤労法管理事務所、  smile勘定科目名:  支払報酬
    {from: ["6227", "87"],  to: ["764", "1007"]},   //TKC_勘定科目名:  あずさ監査法人、  smile勘定科目名:  支払報酬
    {from: ["6227", "102"],  to: ["764", "1008"]},   //TKC_勘定科目名:  森田司法書士事務所、  smile勘定科目名:  支払報酬
    {from: ["6227", "104"],  to: ["764", "1009"]},   //TKC_勘定科目名:  赤坂監査法人、  smile勘定科目名:  支払報酬
    {from: ["6227", "164"],  to: ["764", "1010"]},   //TKC_勘定科目名:  響きパートナーズ、  smile勘定科目名:  支払報酬
    {from: ["6227", "228"],  to: ["764", "1011"]},   //TKC_勘定科目名:  税理士法人無十、  smile勘定科目名:  支払報酬
    {from: ["6227", "A"],  to: ["764", "1012"]},   //TKC_勘定科目名:  株主総会関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "B"],  to: ["764", "1013"]},   //TKC_勘定科目名:  監査証明業務、  smile勘定科目名:  支払報酬
    {from: ["6227", "C"],  to: ["764", "1014"]},   //TKC_勘定科目名:  採用関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "D"],  to: ["764", "1015"]},   //TKC_勘定科目名:  上場関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "E"],  to: ["764", "1016"]},   //TKC_勘定科目名:  税務関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "F"],  to: ["764", "1017"]},   //TKC_勘定科目名:  登記関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "G"],  to: ["764", "1018"]},   //TKC_勘定科目名:  特許関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "H"],  to: ["764", "1019"]},   //TKC_勘定科目名:  特許利用関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "I"],  to: ["764", "1020"]},   //TKC_勘定科目名:  非監査証明業務、  smile勘定科目名:  支払報酬
    {from: ["6227", "J"],  to: ["764", "1021"]},   //TKC_勘定科目名:  法律相談関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "K"],  to: ["764", "1022"]},   //TKC_勘定科目名:  労務関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "L"],  to: ["764", "1023"]},   //TKC_勘定科目名:  製品デザイン費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "M"],  to: ["764", "1024"]},   //TKC_勘定科目名:  製品品質テスト関連費用、  smile勘定科目名:  支払報酬
    {from: ["6227", "Z"],  to: ["764", "9999"]},   //TKC_勘定科目名:その他、  smile勘定科目名:  支払報酬
    {from: ["7115", "A"],  to: ["806", "1000"]},   //TKC_勘定科目名:  決済、  smile勘定科目名:  為替差益
    {from: ["7115", "B"],  to: ["806", "1001"]},   //TKC_勘定科目名:  評価替、  smile勘定科目名:  為替差益
    {from: ["7115", "Z"],  to: ["806", "9999"]},   //TKC_勘定科目名: その他、  smile勘定科目名:  為替差益
    {from: ["7516", "A"],  to: ["851", "1000"]},   //TKC_勘定科目名:  決済、  smile勘定科目名:  為替差損
    {from: ["7516", "B"],  to: ["851", "1001"]},   //TKC_勘定科目名:  評価替、  smile勘定科目名:  為替差損
    {from: ["7516", "Z"],  to: ["851", "9999"]},   //TKC_勘定科目名:その他、  smile勘定科目名:  為替差損
    {from: ["5455", "A"],  to: ["683", "1000"]},   //TKC_勘定科目名:  器具備品、  smile勘定科目名:  減価償却費
    {from: ["5455", "Z"],  to: ["683", "9999"]},   //TKC_勘定科目名:その他、  smile勘定科目名:  減価償却費
    {from: ["5456", "A"],  to: ["684", "1000"]},   //TKC_勘定科目名:  保守部品償却費、  smile勘定科目名:  修繕費
    {from: ["5456", "Z"],  to: ["684", "9999"]},   //TKC_勘定科目名:  、  smile勘定科目名:  修繕費
  ]

const errroCodes = []

const getSmileAccountSubCode = (value) => {
  let fromCode = value[0]
  let fromSubCode = value[1]
  if (fromCode === '' || fromSubCode === '') {
    return undefined
  }
  let row = codeTable.find(row => row.from[0] === fromCode && row.from[1] === fromSubCode)
  if (!row) {
    return undefined
  }
  return row.to[1]
}


module.exports = {
  getSmileAccountSubCode
}
