// key: TKCのコード, value: Smileのコード
const smileAccountTables = {
  1111: 101, //小口現金
  1113: 103, //普通預金
  1122: 109, //売掛金
  1131: 111, //商品
  1132: 112, //製品
  1138: 113, //製品評価損引当額
  1134: 115, //原材料
  1137: 114, //原材料保守部品償却累計額
  1136: 116, //貯蔵品
  1152: 122, //前払費用
  1151: 117, //前払金
  1154: 120, //未収入金
  1155: 119, //立替金
  1156: 121, //仮払金
  1164: 123, //仮払消費税等
  1161: 124, //未収消費税
  1157: 125, //仮払税金
  1162: 129, //未収還付法人税等
  1218: 202, //建物付属設備
  1226: 207, //建物附属設備減価償却累計
  1213: 203, //機械及び装置
  1216: 205, //工具、器具及び備品
  1225: 208, //器具備品減価償却累計額
  1222: 209, //建設仮勘定(有形)
  1234: 118, //仮払金（仮）
  1235: 212, //商標権
  1237: 215, //ソフトウェア
  1238: 217, //ソフトウェア仮勘定
  1255: 220, //敷金・保証金
  9991: 302, //資金諸口
  9992: 303, //資金外諸口
  2112: 402, //買掛金
  2114: 404, //未払金
  2115: 405, //未払費用
  2125: 414, //未払法人税等
  2116: 406, //前受金
  2117: 408, //預り金
  2121: 410, //社会保険預り金
  2118: 409, //前受収益
  2119: 407, //仮受金
  2164: 413, //仮受消費税等
  2123: 416, //匿名組合出資預り金
  2126: 412, //賞与引当金
  2127: 417, //製品保証引当金
  2265: 419, //繰延税金負債
  2311: 421, //製品保証引当金
  2312: 423, //資産除去債務
  3111: 501, //資本金
  3211: 502, //資本準備金
  3611: 546, //新株予約権
  4111: 601, //商品売上高
  4112: 602, //商品転用売上
  4113: 603, //部品売上
  4114: 604, //レンタル売上
  4116: 605, //その他売上
  4117: 606, //保守売上
  4115: 607, //売上値引戻り高
  5111: 631, //期首商品及び製品棚卸高
  5211: 632, //商品仕入高
  5216: 636, //減価償却費
  5217: 634, //製品評価損
  5218: 635, //原材料評価損
  5273: 633, //他勘定振替高
  5311: 640, //期末商品及び製品棚卸高
  6211: 741, //役員報酬
  6111: 742, //給料手当
  6213: 743, //従業員賞与
  6315: 744, //賞与引当金繰入
  6311: 746, //雑給
  6321: 751, //通勤手当
  6322: 747, //退職給付費用
  6312: 748, //法定福利費
  6226: 750, //福利厚生費
  6212: 745, //人件費諸費
  6320: 749, //株式報酬費用
  6115: 784, //発送配達費
  6113: 701, //広告宣伝費
  6318: 767, //保管料
  6317: 703, //販売手数料
  6319: 702, //販売促進費
  6223: 771, //接待交際費
  6114: 768, //人材採用費
  6112: 761, //旅費交通費
  6218: 762, //通信費
  6225: 773, //消耗器具備品
  6217: 774, //事務用品費
  6224: 775, //保険料
  6216: 776, //修繕費
  6232: 777, //事務所管理諸費
  6233: 778, //新聞図書費
  6215: 766, //地代家賃
  6116: 770, //支払手数料
  6313: 780, //諸会費
  6228: 772, //会議費
  6221: 781, //租税公課
  6118: 704, //展示会費用
  6214: 782, //減価償却費
  6117: 765, //業務委託料
  6229: 763, //研究開発費
  6234: 779, //支払リース料
  6227: 764, //支払報酬
  6119: 705, //製品保証引当金繰入
  6219: 769, //水道光熱費
  6316: 783, //利息費用
  6231: 785, //雑費
  7111: 801, //受取利息
  7112: 802, //製品保証引当金戻入
  7113: 803, //補助金収入
  7115: 806, //為替差益
  7118: 804, //雑収入
  7513: 805, //匿名組合損益分配額
  7516: 851, //為替差損
  7519: 852, //雑損失
  8114: 901, //前期損益修正益
  8212: 921, //固定資産除却損
  8215: 922, //減損損失
  8214: 923, //前期損益修正損
  8311: 941, //法人税、住民税及び事業税
  8312: 942, //法人税等調整額
  9211: 507, //繰越利益剰余金期首残高
  5411: 641, //期首材料たな卸高
  5412: 642, //材料仕入高
  5413: 643, //期末材料たな卸高
  5441: 681, //外注加工費
  5454: 682, //運賃
  5455: 683, //減価償却費
  5456: 684, //修繕費
  5473: 685, //他勘定振替高
  3331: 542, //繰越利益剰余金
}

const errroCodes = []

const getSmileAccountCode = (fromCode) => {
  if (fromCode in smileAccountTables) {
    return smileAccountTables[fromCode]
  }

  if (errroCodes.includes(fromCode)) {
    return
  }
  errroCodes.push(fromCode)
  console.log(errroCodes.join())
}


module.exports = {
  getSmileAccountCode
}
